In [1]:
import pandas as pd
import numpy as np

In [2]:
# Empty data frame
df = pd.DataFrame()

In [3]:
df

Empty DataFrame
Columns: []
Index: []

In [4]:
print(df)

Empty DataFrame
Columns: []
Index: []

In [5]:
df1 = pd.DataFrame([[1,2,3,4,5],[6,7,8,9,0],[11,12,13,14,15],[16,17,18,19,20],[21,22,23,24,25]], columns =['A','B','C','D','E'])

In [6]:
df1

    A   B   C   D   E
0   1   2   3   4   5
1   6   7   8   9   0
2  11  12  13  14  15
3  16  17  18  19  20
4  21  22  23  24  25

In [7]:
df1.head(3)

    A   B   C   D   E
0   1   2   3   4   5
1   6   7   8   9   0
2  11  12  13  14  15

In [8]:
df1.tail(3)

    A   B   C   D   E
2  11  12  13  14  15
3  16  17  18  19  20
4  21  22  23  24  25

In [9]:
df1.shape

(5, 5)

In [10]:
df1.iloc[0:2,0:2]

   A  B
0  1  2
1  6  7

In [11]:
df1.iloc[0:2,1:3]

   B  C
0  2  3
1  7  8

# Reading csv

In [27]:
df = pd.read_csv('psx.csv')

In [29]:
df.head()

,SYMBOL CODE,BLANK SALE VOLUME,BLANK SALE VALUE (As per Futures Market Closing Price),OPEN INTEREST VOLUME,OPEN INTEREST VALUE (As per Futures Market Closing price),FREE FLOAT,*BLANK SALE AS PERCENTAGE OF OPEN INTEREST,*BLANK SALE AS PERCENTAGE OF FREE FLOAT
0,ASTL-AUG,105000.0,5257350.0,3441500.0,172315905.0,74252857.0,3.0510,0.1414
1,ATRL-AUG,1051325.0,172774750.0,2852500.0,468779850.0,42646500.0,36.8563,2.4652
2,AVN-AUG,420144.0,25196036.0,2670500.0,160149885.0,58213012.0,15.7328,0.7217
3,BAFL-AUG,4000.0,155800.0,1053000.0,41014350.0,710866048.0,0.3799,0.0006
4,BAHL-AUG,500.0,32285.0,2500.0,161425.0,722426520.0,20.0000,0.0001

In [36]:
df['SYMBOL CODE'].astype('category')

0                            ASTL-AUG
1                            ATRL-AUG
2                             AVN-AUG
3                            BAFL-AUG
4                            BAHL-AUG
5                             BOP-AUG
6                            CHCC-AUG
7                            DGKC-AUG
8                             DOL-AUG
9                           EFERT-AUG
10                          ENGRO-AUG
11                           EPCL-AUG
12                           FCCL-AUG
13                           FFBL-AUG
14                            FFL-AUG
15                           GATM-AUG
16                           GHNI-AUG
17                           GHNL-AUG
18                           GTYR-AUG
19                         HASCOL-AUG
20                            HBL-AUG
21                           INIL-AUG
22                            ISL-AUG
23                          KAPCO-AUG
24                            KEL-AUG
25                           KOHC-AUG
26                        LOTCHEM-AUG
27                           LUCK-AUG
28                            MCB-AUG
29                           MEBL-AUG
30                           MLCF-AUG
31                         MUGHAL-AUG
32                            NBP-AUG
33                            NCL-AUG
34                         NETSOL-AUG
35                            NML-AUG
36                            NRL-AUG
37                           OGDC-AUG
38                           PAEL-AUG
39                          PIBTL-AUG
40                           PIOC-AUG
41                            POL-AUG
42                            PPL-AUG
43                            PSO-AUG
44                          SEARL-AUG
45                           SNGP-AUG
46                           SSGC-AUG
47                            TRG-AUG
48                            UBL-AUG
49                          UNITY-AUG
50                                NaN
51                                NaN
52                                NaN
53                                NaN
54    *Rounded to 4th decimal places.
Name: SYMBOL CODE, dtype: category
Categories (51, object): [*Rounded to 4th decimal places., ASTL-AUG, ATRL-AUG, AVN-AUG, ..., SSGC-AUG, TRG-AUG, UBL-AUG, UNITY-AUG]

In [37]:
print(df['SYMBOL CODE'].dtype)

object

In [38]:
print(df['OPEN INTEREST VOLUME'].dtype)

float64

# Writing csv

In [39]:
df1

    A   B   C   D   E
0   1   2   3   4   5
1   6   7   8   9   0
2  11  12  13  14  15
3  16  17  18  19  20
4  21  22  23  24  25

In [41]:
df1.to_csv('export.csv' , index=False)

In [42]:
df = pd.DataFrame([[1,2,3],[6,7,8],[11,12,13]], columns =['A','B','C'])

In [45]:
df

    A   B   C
0   1   2   3
1   6   7   8
2  11  12  13

In [46]:
df2 = pd.DataFrame([[31,2,33],[46,7,48],[71,2,73]], columns =['X','Y','Z'])

In [47]:
df2

    X  Y   Z
0  31  2  33
1  46  7  48
2  71  2  73

## Merge Dataframes

In [55]:
df3 = pd.merge(df,df2, right_on='Y', left_on='B')

In [56]:
df3

   A  B  C   X  Y   Z
0  1  2  3  31  2  33
1  1  2  3  71  2  73
2  6  7  8  46  7  48